<?php
//Като използвате цикъл for, да се напише програма, кяото проверява дали число $n е просто.
  $n=271;
  $yes='';
  if ($n<2 || intval($n) != $n) { $yes='not'; } // n е по-малко от 2 или не е цяло => не може да е просто
  elseif ($n>2) {
    for ($i=2; $i<$n; $i++) { //проверка има ли поне един делител по-малък от n
      if ($n % $i == 0) {     //i е делител => n не е просто
        $yes='not';
        echo "divided on $i<br/>";
        $i=$n;
      }
    }
  }
  echo "$n - is $yes simple";
?>
