<?php
//   1. Всяка цифра се умножава със съответното ѝ тегло:
//      Позиция 	1 	2 	3 	4 	5 	6 	7 	8 	9
//        Тегло 	2 	4 	8 	5 	10 	9 	7 	3 	6
//   2. Получените произведения се сумират
//   3. Сумата се дели на 11
//   4. Ако остатъкът от делението е по-малък от 10, тогава той се взема като контролна цифра, иначе – 0
  $egn9='710222200';
  $weight=array(2,4,8,5,10,9,7,3,6);
  $c=0;
  for ($i=0; $i<9; $i++) {
    $c += $egn9[$i]*$weight[$i];
  }
  if ($c % 11 < 10) { echo $c % 11; }
  else { echo 0; }
?>
