<?php
//Да се генерира двумерен масив с размери МxN и произволни стойности. Да се намери 
//най-малък елемент за всяка колона. И накрая да се намери сумата от най-малките 
//елементи за всяка колона.
  $m=4;
  $n=4;
  $arr=array(array());
  for ($i=0; $i<$m; $i++) {
    for ($j=0; $j<$n; $j++) {
      $arr[$i][$j]=  rand(10,99);
      echo $arr[$i][$j]." ";
    }
    echo "<br/>";
  }
  $total=0;
  echo "<br/>";
  for ($j=0; $j<$n; $j++) {
    $min=$arr[0][$j];
    for ($i=1; $i<$m; $i++) {
      if ($arr[$i][$j]<$min) {
        $min=$arr[$i][$j];
      }
    }
    echo "$min ";
    $total+=$min;
  }
  echo "<br/>total = $total";
?>
